// შექმენით მასივი, სახელწოდებით 'allValue' და გადაეცით შემდეგი მონაცემთა ტიპები: 1. integer   2. string   3. float   4. boolean   5. object, გადაცემულ ობიექტში უნდა იყვეს შეტანილი ინფორმაცია, 1. სახელი   2. გვარი   3. ასაკი   4. ქვეყანა    5. ქალაქი.
// შემდეგ უნდა ააწყოთ წინადადება თქვენს თავზე, 'ჩემი სახელია ... ჩემი გვარია ... ' და ა..შ  ----   (მასივში ჩაშენებული ობიექტიდან უნდა ააწყოთ წინადადება)

let  allValu = [14,'nika',1.80,true]
console.log('my name is ' +  allValu[1] + ' '+ "my age is " +  allValu[0] + ' ' + 'and my height is ' +  allValu[2])