// სტუდენტისგან შემოტანეთ 3 სხვადასხვა საგნის ქულა, შემდეგ გამოითვალეთ საშუალო ქულა და საშუალო ქულის შესაფერისად გამოტანეთ შეფასება, თუ სტუდენტის ქულა მეტია 90 -  ზე და ნაკლებია 100 - ზე, მაშინ გამოიტანეთ 'A', სხვა შემთხვევაში თუ სტუდენტის ქულა მეტია 70 - ზე და ნაკლებია 80 - ზე, მაშინ გამოიტანეთ 'B', სხვა შემთხვევაში თუ სტუდენტის ქულა მეტია 50 - ზე და ნაკლებია 65 - ზე, მაშინ გამოიტანეთ 'C', სხვა შემთხვევაში თუ სტუდენტის ქულა მეტია 25 - ზე და ნაკლებია 50 - ზე, მაშინ გამოიტანეთ 'D', ხოლო თუ 25 -  ზე ნაკლებია, მაშინ გამოიტანეთ 'წადი ისწავლე და მერე მოდი'

let math = prompt('What is your scor in math: ')
let chemistry = prompt('What is your scor in chemistry: ')
let physic = prompt('What is your scor in physic: ')

let sum = (math + chemistry + physic) / 3

if(sum >= 90 && sum <= 100){
    console.log('A')
}else if (sum >=  70 && sum <= 80){
    console.log('B')
}else if (sum >= 50 && sum <= 65){
    console.log('C')
}else if ( sum >= 25 && sum <= 50){
    console.log('D')
}else if (sum < 25){
    console.log('წადი ისწავლე და მერე მოდი')
}