//შექმენით password ცვლადი და მიანიჭეთ მნიშვნელობა 'Group 41 is best'
// თქვენი დავალებაა, რომ შექმნათ ფუნქცია და გამოიცნოთ პაროლი იქამდე, სანამ პაროლი არ იქნება სწორი, მთლიანობაში გაქვთ 3 ცდა, როდესაც ცდების რაოდენობა გამოილევა, alert - ის დახმარებით გამოიტანეთ მესიჯი 'თქვენ ამოგეწურათ ცდების რაოდენობა', როდესაც პაროლი იქნება სწორი, გამოიტანეთ ' თქვენი შეყვანილი პაროლი სწორია'.

function guessPassword() {
    const password = "Group 41 is best";
    let attempts = 3;
  
    while (attempts > 0) {
      let userInput = prompt("გთხოვთ, შეიყვანოთ პაროლი:");
      
      if (userInput === password) {
        alert("თქვენი შეყვანილი პაროლი სწორია");
        return;
      } else {
        attempts--;
        if (attempts > 0) {
          alert(`პაროლი არასწორია. დარჩენილი ცდების რაოდენობა: ${attempts}`);
        }
      }
    }
  
    alert("თქვენ ამოგეწურათ ცდების რაოდენობა");
  }
  

  guessPassword();


