//შექმენით პროგრამა, რომელიც მიიღებს მომხმარებლის ინფორმაციას (ასაკი, სქესი და შემოსავალი) და თითოეულის მიხედვით გააკეთებს პირად ფინანსურ დაგეგმვას. შემდეგი ლოგიკით:
// თუ მომხმარებელი 18 წლის ან უფროსია:
// თუ მომხმარებელი ქალია:
// თუ შემოსავალი 5000 ლარზე მეტია:
// დაბეჭდოს - 'თქვენი ფინანსური მგომარეობა უზრუნველყოფილია'
// თუ შემოსავალი 5000 ლარზე ნაკლებია და 3000 ლარზე მეტია:
// დაბეჭდავ "ფინანსური პოზიცია სტაბილურია. უკეთესი გეგმაა საჭირო."
// თუ შემოსავალი 3000 ლარზე ნაკლებია:
// დაბეჭდოს - 'გჭირდებათ ფინანსური გეგმის გაუმჯობესება'

func = () => {
    let age = Number(prompt('Enter your age: '))
    let gender = prompt('Enter your gender: ')
    let income = Number(prompt('Enter your income: '))

    if(age >= 18){
        if (gender == "women"){
            if (income > 5000){
                console.log('თქვენი ფინანსური მგომარეობა უზრუნველყოფილია')
            }else if (income <= 500 && income > 300){
                console.log("ფინანსური პოზიცია სტაბილურია. უკეთესი გეგმაა საჭირო.")
            }else if (income < 300){
                console.log('გჭირდებათ ფინანსური გეგმის გაუმჯობესება')
            }
        }
    }
}
func()  